{
  "file": "01_Employee_Handbook_2024.pdf",
  "total_pages": 3,
  "chunks": [
    {
      "id": 1,
      "text": "Employee Handbook 2024",
      "page": 1,
      "word_count": 3
    },
    {
      "id": 2,
      "text": "Version: 2024.1 | Effective: January 1, 2024 Welcome to ClearPath Welcome to ClearPath! We're thrilled to have you join our team. ClearPath is dedicated to creating powerful project management tools that empower teams worldwide to work smarter, collaborate better, and ship faster. Founded in 2018 in San Francisco, we've grown to over 200 employees across 15 countries, serving more than 50,000 teams globally. This handbook outlines company policies, benefits, expectations, and resources available to all employees. Please read it carefully and refer back to it as needed. If you have questions, don't hesitate to reach out to your manager or the People Operations team at hr@clearpath.io. Our Mission and Values Mission: To simplify project management and help teams achieve their goals through intuitive, powerful software that adapts to how they work. Core Values:  Customer First: We obsess over customer needs and deliver exceptional experiences  Move Fast: We ship quickly, iterate often, and learn from our mistakes  Own It: We take ownership of our work and hold ourselves accountable  Better Together: We collaborate across teams and celebrate wins together  Think Big: We're building something that will transform how teams work globally Employment Basics Employment Classification: ClearPath employees are classified as either exempt (salaried) or non-exempt (hourly). Your offer letter specifies your classification. Full-time employees work 40 hours per week. Part-time employees work fewer than 30 hours per week and are not eligible for all benefits. Probationary Period: All new employees have a 90-day probationary period. During this time, we'll work together to ensure the role is a good fit. You'll have regular check-ins with your manager and a formal review at 30, 60, and 90 days. Background Checks: Employment is contingent on successful completion of background checks and verification of eligibility to work in your country of employment. Working Hours and Schedule Standard working hours are 9:00 AM to 5:00 PM local time, Monday through Friday, with a one-hour lunch break (unpaid for non-exempt employees). We understand that life happens and flexibility is important. Flexible start times (between 7:00 AM and 10:00 AM) are available with manager approval. Core Hours: All team members should be available during core collaboration hours: 10:00 AM to 3:00 PM in their primary timezone. This ensures adequate overlap for meetings and real-time collaboration. Remote employees should maintain this overlap with their immediate team. Overtime: Non-exempt employees who work more than 40 hours in a workweek will be paid overtime at 1.5x their regular rate. All overtime must be pre-approved by your manager. Exempt employees are not eligible for overtime pay. Timekeeping: Non-exempt employees must accurately track their hours using our time tracking system (BambooHR). Timesheets are due every Friday and are reviewed and approved by your manager. Falsification of time records is grounds for termination. Compensation Pay Schedule: Employees are paid semi-monthly on the 15th and last day of each month. If payday falls on a weekend or holiday, payment will be made on the preceding business day. Direct deposit is required for all employees. Salary Reviews: ClearPath conducts annual salary reviews in January. Performance reviews occur in December, and compensation adjustments (if any) take effect in the following January payroll. Promotions may result in mid-year salary adjustments. Equity: Many employees receive stock options as part of their compensation package. Options vest over 4 years with a 1-year cliff. Details about your equity grant, vesting schedule, and exercise options are provided in your offer letter and managed through Carta. Benefits Overview ClearPath offers comprehensive benefits starting on your first day of employment. Full-time employees are eligible for all benefits listed below. Part-time employees receive prorated benefits. Benefit Coverage Details Health Insurance Medical, dental, and vision. ClearPath covers 100% of employee premiums, 75% for dependents 401(k) Retirement 4% company match, immediate vesting. Contributions via Guideline Life Insurance 2x annual salary, company-paid. Optional supplemental coverage available Disability Insurance Short-term and long-term disability coverage, company-paid Health Savings Account Available with HDHP. ClearPath contributes $1,000 annually Commuter Benefits Pre-tax transit and parking up to IRS limits Learning Stipend $2,000 annually for courses, conferences, books, certifications Home Office Stipend $500 annually for remote workers (desk, chair, equipment) Wellness Stipend $100 monthly for gym, fitness classes, mental health apps Professional Development We believe in continuous learning and growth. Each employee receives an annual $2,000 learning stipend for conferences, online courses, books, certifications, and other educational materials related to your role. How to Use Your Stipend:  Expenses under $500: Submit for reimbursement via Expensify with manager approval  Expenses over $500: Require pre-approval from your manager and VP  Conference attendance: Also covers travel and accommodation  Unused stipend does not roll over to the next year Internal Learning: We host monthly lunch-and-learns, quarterly all-hands presentations, and maintain an internal knowledge base. Engineering teams have dedicated 'learning Fridays' for exploring new technologies. Performance Reviews Performance reviews occur annually in December. The process includes:  Self-assessment (you reflect on your accomplishments and growth areas)  Peer feedback (input from 3-5 colleagues you work with regularly)  Manager review (your manager's assessment of your performance)  Calibration sessions (leadership ensures consistency across teams)  Review conversation (you and your manager discuss feedback and goals) New employees have check-ins at 30, 60, and 90 days. All employees have 1:1s with their manager at least bi-weekly to discuss ongoing feedback, blockers, and career development. Workplace Policies Dress Code: We maintain a casual dress code. Wear what makes you comfortable and helps you do your best work. When meeting with customers or partners, use your judgment for business casual attire. Workplace Safety: ClearPath is committed to providing a safe work environment. Report any safety concerns to facilities@clearpath.io. In case of emergency, call 911 first, then notify your manager. Drug and Alcohol Policy: ClearPath maintains a drug-free workplace. Being under the influence of alcohol or illegal substances during work hours is prohibited. This includes video calls and virtual meetings. Company Property and Equipment ClearPath provides you with the equipment needed to do your job: laptop (MacBook Pro or Dell XPS), external monitor, keyboard, mouse, and headphones. Remote employees may request additional equipment (standing desk, ergonomic chair) up to $500. All company property must be returned upon termination of employment. Lost or damaged equipment may result in paycheck deductions (where legally permitted). Report lost or stolen equipment immediately to it@clearpath.io. Questions? If you have questions about any policy in this handbook, please contact:  Your manager (first point of contact)  People Operations: hr@clearpath.io  Benefits questions: benefits@clearpath.io  Payroll questions: payroll@clearpath.io",
      "page": 1,
      "word_count": 1088
    }
  ]
}